/////Нагревают m литров воды, начальная температура воды t. Воде было передано k
////джоулей энергии.Определить, сколько воды осталось, и какова ее температура
/////(варианты: вода нагрелась до температуры менее 100 градусов, температура нагрелась
//////до 100 градусов и часть воды испарилась, вся вода испарилась).Коэффициенты
/////физических процессов взять из школьного курса физики

#include<iostream>     
#include<cmath>
#include<math.h>
using namespace std;
void main()
{
    setlocale(LC_ALL, "Russian");
    while (true)
    {
        int z;
        cout << "\nВыберите действие: 1-Вычисление,0-Выход" << endl;
        cin >> z;
        if (z == 0)
        {
            break;
        }
        else
        {
            int C = 4200;    /////      Это удельная теплоёмкость воды.

            double Q;
            cout << "Введите пожалуйста значение Кол-во теплоты[Дж]: " << endl;
            cin >> Q;

            double m1;
            cout << "Введите пожалуйста значение начальной массы воды [кг]: " << endl;
            cin >> m1;

            double t1;
            cout << "Введите пожалуйста значение начальной температуры воды [c]: " << endl;
            cin >> t1;

            double t2;
            t2 = (Q / (m1 * C)) + t1;
            if (t2 < 100)
            {
                cout << "\tТемпература воды[c] = " << t2 << endl;
                cout << " \tМасса воды до испарения[кг] = " << m1 << endl;
            }
            else
            {
                double m2;
                double L = 2260;   ///// Удельная теплота парообразования воды.
                double mowae;    ///// Масса воды после испарения.  Mass of water after evaporetion (mowae).

                m2 = Q / L;
                mowae = m1 - m2;

                if (mowae > 0)
                {
                    cout << "\tМасса воды после испарения [кг] = " << mowae << endl;
                    cout << "\tТемпература воды [c] = " << t2 << endl;
                }
                if (mowae == 0)
                {
                    cout << "\tВода полностью испарилась!!!\n" << mowae << endl;
                }
            }
        }
    }
}